/**
 * 1. Пограємо в Kahoot

1. Познайомимось з контекст виконання функції 
- Ключове слово this
- Глобальний контекст
- Контекст методу об'єкта (практика **01-this.js)**

Практика  (практика **02-tasks.js)**

- Методи call(), apply(), bind() і втрата контексту
- Метод bind() і колбеки (практика **03-methods.js)**
- Стрілочні функції
- Алгоритм визначення this) (практика 01-callbacks.js)

1. Розберемо прототипи
- Прототип об'єкта
- Перевірка прототипу
- Власні і невласні властивості
- Перебір власних властивостей
- Ланцюжки прототипів
- Кінець ланцюжка прототипів (практика **04-prototype.js)**

1. Що на вас чекатиме на **наступному занятті**? Ми поговоримо про процедурне програмування та ОАП та розглянемо класи.
 *  - Оголошення класу
 *  - Конструктор класу
 *  - Методи класу
 *  - Прототип екземпляру
 *  - Приватні властивості
 *  - Геттери і сеттери
 *  - Статичні властивості
 */
